## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.fluent[0].module.helm.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "fluent-bit"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fluent"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://fluent.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                config:
                  outputs: |
                    [OUTPUT]
                        host loki.fullstack.pw
                        name                   loki
                        match                  *
                        labels                 job=fluentbit,cluster=stg
                        auto_kubernetes_labels on
                        port 443
                        tls on
            EOT,
        ]
      + verify                     = false
      + version                    = "0.48.9"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.otel_collector[0].module.helm.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "opentelemetry-collector"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "opentelemetry-collector"
      + namespace                  = "observability"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://open-telemetry.github.io/opentelemetry-helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                mode: deployment
                
                presets:
                  logsCollection:
                    enabled: false
                
                ports:
                  otlp:
                    enabled: true
                    containerPort: 4317
                    servicePort: 4317
                    protocol: TCP
                  otlp-http:
                    enabled: true
                    containerPort: 4318
                    servicePort: 4318
                    protocol: TCP
                
                config:
                  receivers:
                    otlp:
                      protocols:
                        grpc:
                          endpoint: 0.0.0.0:4317
                        http:
                          endpoint: 0.0.0.0:4318
                
                  processors:
                    batch:
                      timeout: 1s
                      send_batch_size: 1024
                    memory_limiter:
                      check_interval: 1s
                      limit_percentage: 80
                      spike_limit_percentage: 25
                
                  exporters:
                    otlphttp/sandbox:
                      endpoint: "https://otel-collector.fullstack.pw"
                      tls:
                        insecure: false
                    logging:
                      loglevel: debug
                
                  service:
                    pipelines:
                      traces:
                        receivers: [otlp]
                        processors: [memory_limiter, batch]
                        exporters: [otlphttp/sandbox, logging]
                      metrics:
                        receivers: [otlp]
                        processors: [memory_limiter, batch]
                        exporters: [otlphttp/sandbox, logging]
                
                resources:
                  limits:
                    cpu: 200m
                    memory: 256Mi
                  requests:
                    cpu: 100m
                    memory: 128Mi
            EOT,
        ]
      + verify                     = false
      + version                    = "0.62.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.otel_collector[0].module.namespace.kubernetes_namespace.this[0] will be created
  + resource "kubernetes_namespace" "this" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "observability"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.fluent[0].module.helm.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "fluent-bit"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "fluent"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://fluent.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                config:
                  outputs: |
                    [OUTPUT]
                        host loki.fullstack.pw
                        name                   loki
                        match                  *
                        labels                 job=fluentbit,cluster=prod
                        auto_kubernetes_labels on
                        port 443
                        tls on
            EOT,
        ]
      + verify                     = false
      + version                    = "0.48.9"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.otel_collector[0].module.helm.helm_release.this will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "opentelemetry-collector"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "opentelemetry-collector"
      + namespace                  = "observability"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://open-telemetry.github.io/opentelemetry-helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                mode: deployment
                
                presets:
                  logsCollection:
                    enabled: false
                
                ports:
                  otlp:
                    enabled: true
                    containerPort: 4317
                    servicePort: 4317
                    protocol: TCP
                  otlp-http:
                    enabled: true
                    containerPort: 4318
                    servicePort: 4318
                    protocol: TCP
                
                config:
                  receivers:
                    otlp:
                      protocols:
                        grpc:
                          endpoint: 0.0.0.0:4317
                        http:
                          endpoint: 0.0.0.0:4318
                
                  processors:
                    batch:
                      timeout: 1s
                      send_batch_size: 1024
                    memory_limiter:
                      check_interval: 1s
                      limit_percentage: 80
                      spike_limit_percentage: 25
                
                  exporters:
                    otlphttp/sandbox:
                      endpoint: "https://otel-collector.fullstack.pw"
                      tls:
                        insecure: false
                    logging:
                      loglevel: debug
                
                  service:
                    pipelines:
                      traces:
                        receivers: [otlp]
                        processors: [memory_limiter, batch]
                        exporters: [otlphttp/sandbox, logging]
                      metrics:
                        receivers: [otlp]
                        processors: [memory_limiter, batch]
                        exporters: [otlphttp/sandbox, logging]
                
                resources:
                  limits:
                    cpu: 200m
                    memory: 256Mi
                  requests:
                    cpu: 100m
                    memory: 128Mi
            EOT,
        ]
      + verify                     = false
      + version                    = "0.62.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.otel_collector[0].module.namespace.kubernetes_namespace.this[0] will be created
  + resource "kubernetes_namespace" "this" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + name             = "observability"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

#########################################################
##
##   Planning changes for sandbox environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

  ```
  
  Plan exit code: 0
  